app/Http/Controllers/Web/WebController.php

            }
        }

        return view('web-views.shop-page', compact('products', 'shop', 'categories'))
            ->with('seller_id', $id)
            ->with('total_review', $total_review)
            ->with('avg_rating', $avg_rating)
            ->with('total_order', $total_order);
---
select * from `reviews` where `reviews`.`product_id` in (1)