app/CPU/helpers.php

    public static function rating_count($product_id, $rating)
    {
        return Review::where(['product_id' => $product_id, 'rating' => $rating])->count();
---
select count(*) as aggregate from `reviews` where (`product_id` = 2 and `rating` = 5)

    public static function get_business_settings($name)
    {
        $config = null;
        $check = ['currency_model', 'currency_symbol_position', 'system_default_currency', 'language', 'company_name'];

        if (in_array($name, $check) == true && session()->has($name)) {
            $config = session($name);
        } else {
            $data = BusinessSetting::where(['type' => $name])->first();
---
select * from `business_settings` where (`type` = 'maintenance_mode') limit 1

    public static function pagination_limit()
    {
        $pagination_limit = BusinessSetting::where('type', 'pagination_limit')->first();
---
select * from `business_settings` where `type` = 'pagination_limit' limit 1