app/Http/Controllers/Admin/AuthorController.php

select * from `authors` limit 12 offset 0
select count(*) as aggregate from `authors`
---
    public function index(Request $request)
    {

        $search  = $request['search'];

        if($request->has('search'))
        {
            $key = explode(' ', $request['search']);
            $authors = Author::where(function ($q) use ($key) {
                foreach ($key as $value) {
                    $q->orWhere('name', 'like', "%{$value}%");
                    $q->orWhere('name_bangla', 'like', "%{$value}%");
                }
            })->paginate(12);
        }else{
            $authors = Author::paginate(12);