app/Http/Controllers/Admin/CategoryController.php

select * from `categories` where (`position` = 0) order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `categories` where (`position` = 0)
---
    public function index(Request $request)
    {
        $query_param = [];
        $search = $request['search'];
        if($request->has('search'))
        {
            $key = explode(' ', $request['search']);
            $categories = Category::where(function ($q) use ($key) {
                foreach ($key as $value) {
                    $q->orWhere('name', 'like', "%{$value}%");
                }
            });
            $query_param = ['search' => $request['search']];
        }else{
            $categories = Category::where(['position' => 0]);
        }

        $categories = $categories->latest()->paginate(Helpers::pagination_limit())->appends($query_param);

select * from `categories` where `categories`.`id` = '18' limit 1
---
    public function update(Request $request)
    {
        $category = Category::find($request->id);

select * from `categories` where `parent_id` = '4'
delete from `translations` where `translationable_type` = 'App\Model\Category' and `translationable_id` = '4'
delete from `categories` where `id` = 4
---
    public function delete(Request $request)
    {
        $categories = Category::where('parent_id', $request->id)->get();
        if (!empty($categories)) {
            foreach ($categories as $category) {
                $categories1 = Category::where('parent_id', $category->id)->get();
                if (!empty($categories1)) {
                    foreach ($categories1 as $category1) {
                        $translation = Translation::where('translationable_type','App\Model\Category')
                                    ->where('translationable_id',$category1->id);
                        $translation->delete();
                        Category::destroy($category1->id);

                    }
                }
                $translation = Translation::where('translationable_type','App\Model\Category')
                                    ->where('translationable_id',$category->id);
                $translation->delete();

select * from `categories` where `categories`.`id` = '3' limit 1
update `categories` set `home_status` = '1', `categories`.`updated_at` = '2021-12-19 01:46:14' where `id` = 3
---
    public function status(Request $request)
    {
        $category = Category::find($request->id);
        $category->home_status = $request->home_status;
        $category->save();