app/Http/Controllers/Admin/PublisherController.php

    public function index(Request $request)
    {

        $search  = $request['search'];

        if($request->has('search'))
        {
            $key = explode(' ', $request['search']);
            $publishers = Publisher::where(function ($q) use ($key) {
                foreach ($key as $value) {
                    $q->orWhere('name', 'like', "%{$value}%");
                    $q->orWhere('name_bangla', 'like', "%{$value}%");
                }
            })->paginate(12);
        }else{
            $publishers = Publisher::paginate(12);
---
select * from `publishers` limit 12 offset 0
select count(*) as aggregate from `publishers`